/* automatically generated by rust-bindgen 0.71.1 */

pub type err_t = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TMap {
    _unused: [u8; 0],
}
pub type TMap_ptr = *mut TMap;
pub type TMap_search = ::std::option::Option<
    unsafe extern "C" fn(
        map: TMap_ptr,
        key: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ModMetadata {
    pub id: *const ::std::os::raw::c_char,
    pub mod_major_version: u16,
    pub mod_minor_version: u16,
    pub compatible_engine_major_version: u16,
    pub compatible_engine_minor_version: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ModMetadata"][::std::mem::size_of::<ModMetadata>() - 16usize];
    ["Alignment of ModMetadata"][::std::mem::align_of::<ModMetadata>() - 8usize];
    ["Offset of field: ModMetadata::id"][::std::mem::offset_of!(ModMetadata, id) - 0usize];
    ["Offset of field: ModMetadata::mod_major_version"]
        [::std::mem::offset_of!(ModMetadata, mod_major_version) - 8usize];
    ["Offset of field: ModMetadata::mod_minor_version"]
        [::std::mem::offset_of!(ModMetadata, mod_minor_version) - 10usize];
    ["Offset of field: ModMetadata::compatible_engine_major_version"]
        [::std::mem::offset_of!(ModMetadata, compatible_engine_major_version) - 12usize];
    ["Offset of field: ModMetadata::compatible_engine_minor_version"]
        [::std::mem::offset_of!(ModMetadata, compatible_engine_minor_version) - 14usize];
};
pub type ModApplyFunction =
    ::std::option::Option<unsafe extern "C" fn(map: TMap_ptr, search: TMap_search) -> err_t>;
pub type ModValidateFunction =
    ::std::option::Option<unsafe extern "C" fn(map: TMap_ptr, search: TMap_search) -> err_t>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Mod {
    pub metadata: ModMetadata,
    pub apply: ModApplyFunction,
    pub validate: ModValidateFunction,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Mod"][::std::mem::size_of::<Mod>() - 32usize];
    ["Alignment of Mod"][::std::mem::align_of::<Mod>() - 8usize];
    ["Offset of field: Mod::metadata"][::std::mem::offset_of!(Mod, metadata) - 0usize];
    ["Offset of field: Mod::apply"][::std::mem::offset_of!(Mod, apply) - 16usize];
    ["Offset of field: Mod::validate"][::std::mem::offset_of!(Mod, validate) - 24usize];
};
